var parseData = data = [ {
    "id": '485', 
    "name": 'пос. Тураево', 
    "lng": "37.9348468780517578125000", 
    "lat": "55.5562626524584359799519", 
    "description": "голавль, плотва, щука, судак, окунь", 
    "mtype": "free"
}, {
    "id": '486', 
    "name": 'Фишбург', 
    "lng": "46.1288344860076904296875", 
    "lat": "48.3143223201786184972661", 
    "description": "", 
    "mtype": "baza"
}, {
    "id": '487', 
    "name": 'Апендицит оветвляеться от реки Быковка', 
    "lng": "38.0951786041259765625000", 
    "lat": "55.5824199953716586719565", 
    "description": "Неглубокое место 1-2м но крупные лещи заходят на нерест и сазана видел, на удочку подлещик окунь карась. Большая прозьба не мусорить - место относительно чистое и пока проезд туда закрыт (строят дорогу).", 
    "mtype": "free"
}, {
    "id": '489', 
    "name": 'Лесное озеро', 
    "lng": "56.0227203369140625000000", 
    "lat": "58.2850960315964812252787", 
    "description": "Карп,Щука,Окунь,Линь.", 
    "mtype": "free"
}, {
    "id": '490', 
    "name": 'Чулково', 
    "lng": "38.0327796936035156250000", 
    "lat": "55.5637104527623293392935", 
    "description": "удобное место для отдыха и рыбалки, достаточно высокий берег и много уединенных мест для рыболовов", 
    "mtype": "free"
}, {
    "id": '491', 
    "name": 'устье реки Везлома', 
    "lng": "44.0115737915039062500000", 
    "lat": "56.3608760837642890351162", 
    "description": "Окунь, сорога, карась?, щука?", 
    "mtype": "free"
}, {
    "id": '493', 
    "name": 'Туристическая база "Медвежий угол"', 
    "lng": "35.2551269531250000000000", 
    "lat": "67.9527873414695449127976", 
    "description": "", 
    "mtype": "free"
}, {
    "id": '498', 
    "name": 'Пруд (Калиновка)', 
    "lng": "37.7205276489257812500000", 
    "lat": "55.5160949669687511232041", 
    "description": "", 
    "mtype": "free"
}, {
    "id": '499', 
    "name": 'Мячковский (Солдатский) карьер (Лыткарино)', 
    "lng": "37.9609394073486328125000", 
    "lat": "55.5564568341945914653479", 
    "description": "", 
    "mtype": "free"
}, {
    "id": '500', 
    "name": 'Буревестник, Межура', 
    "lng": "36.1484527587890625000000", 
    "lat": "55.1514122025271262828028", 
    "description": "", 
    "mtype": "pay"
}, {
    "id": '501', 
    "name": 'Частное домовладение "Тортуга"', 
    "lng": "48.0761718750000000000000", 
    "lat": "45.3367019099681058946771", 
    "description": "", 
    "mtype": "free"
}, {
    "id": '503', 
    "name": 'Прибалхашье, дельта реки Или', 
    "lng": "74.1989135742187500000000", 
    "lat": "45.4190578501354593754513", 
    "description": "Прекрасное место для рыбалки.", 
    "mtype": "free"
}, {
    "id": '504', 
    "name": 'Байменей', 
    "lng": "74.5463562011718750000000", 
    "lat": "45.5077905484003011338245", 
    "description": "Добираться на лодке 10 км.", 
    "mtype": "free"
}, {
    "id": '506', 
    "name": 'р.Зуша', 
    "lng": "36.4649963378906250000000", 
    "lat": "53.4362918722889546074839", 
    "description": "Донка,спиннинг,поплавочная", 
    "mtype": "free"
}, {
    "id": '507', 
    "name": 'Пирс в Петроваце', 
    "lng": "18.9373612403869628906250", 
    "lat": "42.2049658129775693282681", 
    "description": "", 
    "mtype": "free"
}, {
    "id": '508', 
    "name": 'озеро Лубоярви', 
    "lng": "31.7947769165039062500000", 
    "lat": "63.0420439911487804351964", 
    "description": "дер.Лубосалма, дер.Остров.Отличная рыбалка,щуки, окуни, лещи, налимы...", 
    "mtype": "baza"
}, {
    "id": '510', 
    "name": 'Броницьке озеро', 
    "lng": "25.1494216918945312500000", 
    "lat": "51.6655284652507944542776", 
    "description": "искуственное озеро,ловится карась, хороший окунь, маленький линь, щука зашугана", 
    "mtype": "free"
}, {
    "id": '511', 
    "name": 'оз. Озюрко', 
    "lng": "25.0522613525390625000000", 
    "lat": "51.6297393596567459894686", 
    "description": "окунь, карась, может попадаться и щука", 
    "mtype": "free"
}, {
    "id": '512', 
    "name": '1-й Гутынский став', 
    "lng": "25.0024795532226562500000", 
    "lat": "51.5898694441880607541862", 
    "description": "", 
    "mtype": "pay"
}, {
    "id": '513', 
    "name": 'Гутынский став', 
    "lng": "25.0222206115722656250000", 
    "lat": "51.5874964003971712145358", 
    "description": "Щука, окунь, карась, хорошийлинь", 
    "mtype": "free"
}, {
    "id": '514', 
    "name": 'Лебське озеро', 
    "lng": "24.9276351928710937500000", 
    "lat": "51.6757487349754001115798", 
    "description": "окунь зимой, ...", 
    "mtype": "free"
}, {
    "id": '516', 
    "name": 'с.Козье', 
    "lng": "38.4542083740234375000000", 
    "lat": "53.2664449859087483218900", 
    "description": "р.Красивая Меча(Окунь, Щука, Плотва, Подуст, Голавль, Карп", 
    "mtype": "free"
}, {
    "id": '517', 
    "name": 'Сеть магазинов РИБАЛКА', 
    "lng": "30.5983185768127441406250", 
    "lat": "50.4344659083391277931696", 
    "description": "В продаже есть все даже больше - <a href=\"http://www.mirrybolova.com.ua\" target=\"_blank\">www.mirrybolova.com.ua</a>", 
    "mtype": "free"
}, {
    "id": '518', 
    "name": 'о. Юрьевец', 
    "lng": "43.6660194396972656250000", 
    "lat": "56.2041259939693063074628", 
    "description": "Мы его так называли, не знаю как местные. Утром в 4-5 уже в этом месте где река шире стояло лодок 7, все ловили кто на что. В итоге двух часов кидания и тролинга ничего не поймал. На острове прикольно ночевать, лодку швартуешь прямо на песчаную косу и палатку тоже на неё ставишь", 
    "mtype": "free"
}, 
{
    "id": '519', 
    "name": 'Большой родник', 
    "lng": "43.6620712280273437500000", 
    "lat": "56.1995424785529564815079", 
    "description": "Это и холодильник для рыбы, когда воду набирал там там стоял пакет с рыбой и на него акурат бил водопад ледяной воды. Ну и само собой воду можно брать воду для питья", 
    "mtype": "free"
}, 
{
    "id": '520', 
    "name": 'Щука', 
    "lng": "43.7363576889038085937500", 
    "lat": "56.1917349179154896887667", 
    "description": "Это место недалеко от так называемого директорского пляжа. Шел здесь на лодке, на тихом ходу и тролил, в итоге в&nbsp;&nbsp;середине июля в полуденную жару за 10 минут поймал двух щук на рыбку вибро хвост. Времени у же не было место проловить, поэтому с точки ушел. Что самое интересное обе щуки (первая 2 кг вторая щуренок грамм 700 )взяли при тролинге во время того когда наживка падала, простые забросы с ложки ничего не дали ) ", 
    "mtype": "free"
}, 
{
    "id": '521', 
    "name": 'Коряги', 
    "lng": "43.7509059906005859375000", 
    "lat": "56.1885111496300382327718", 
    "description": ") тут я посеил виброхвост которым поймал двух щук, зацеп произошел прямо в 50 метрах от опоры моста.", 
    "mtype": "free"
}, 
{
    "id": '523', 
    "name": 'Большая Свеча', 
    "lng": "46.2926101684570312500000", 
    "lat": "57.6926349017682511544081", 
    "description": "Ловил тут два раза. Знаю точно что здесь в 2011 вылавливали карпа около 30 кг. Сам я такого не поймал). Ловил в августе приехал на входные, сменилась погода. Поэтому брал только карась, мелкий окунь и плотва. В итоге самым большим трофеем у меня тут стал карась 450 гр. на фидер (кукуруза)", 
    "mtype": "free"
}, 
{
    "id": '524', 
    "name": 'Мшищи', 
    "lng": "38.1953430175781250000000", 
    "lat": "53.3169286674897833222531", 
    "description": "Карась, плотва, щука", 
    "mtype": "free"
}, 
{
    "id": '525', 
    "name": 'Водоем спортивной рыбалки "Кльове місце"', 
    "lng": "33.9453506469726562500000", 
    "lat": "47.9547544794095017550717", 
    "description": "Водоем полностью ориентирован на спортивную ловлю рыбы - карповые, хищник. На водоеме проводятся соревнования по ловле карповых.&nbsp;&nbsp;", 
    "mtype": "pay"
}, 
{
    "id": '528', 
    "name": 'ст.Песчаная балка', 
    "lng": "35.5395698547363281250000", 
    "lat": "45.1361606339427865464131", 
    "description": "", 
    "mtype": "free"
}, 
{
    "id": '529', 
    "name": 'Загородный отель "Парус"', 
    "lng": "45.0109863281250000000000", 
    "lat": "56.0168077632032250789962", 
    "description": "", 
    "mtype": "baza"
} ];

function parserModule(){
}
parserModule.name = 'parserModule';
ModuleManager.add(parserModule);

parserModule.prototype.afterInit = function(){
    this.mm = app.getModule('mapModule');
}
parserModule.prototype.getGeoAndSave= function(loc, token){
    this.address = {
        route:'',
        country:'',
        administrative_area_level_1: '',
        administrative_area_level_2: '',
        locality: ''
    }
    var self = this;
    var ldata = loc;
    this.mm.geocoder.geocode({
        'latLng':  new gm.LatLng(parseFloat(ldata.lat), parseFloat(ldata.lng)),
        'language':'ru'
    }, function(result, status) {
        if (status == gm.GeocoderStatus.OK) {
            var data = result[0];
            fb(data);
            if (data) {
                $.each(data.address_components, function(){
                    if(self.address[this.types[0]] == ''){
                        self.address[this.types[0]] = this.long_name;
                    }
                });
                
                self.address.areaLow = self.address.administrative_area_level_1;
                self.address.areaHigh = self.address.administrative_area_level_2;
                self.address.route = self.address.route;
                delete(self.address.administrative_area_level_1);
                delete(self.address.administrative_area_level_2);
                
                $.ajax({
                    type: 'post',
                    url: '/frontend_dev.php/location/create',
                    dataType: 'html',
                    data: {
                        'location[_csrf_token]':	token,
                        'location[address]':$.JSON.encode(self.address),
                        'location[is_free]':	ldata.mtype == 'free',
                        'location[latitude]':	ldata.lat,
                        'location[longitude]':	ldata.lng,
                        'location[location_scope_id]':	5,
                        'location[name]':	ldata.name,
                        'location[description]':	ldata.description
                    },
                    success: function(form){
                       app.getModule('parserModule').parse1(token);
                    },
                    error: function(request, error, exception){
                        fb('error');
                        fb(error);
                        fb(ldata);
                    }
                });
                
            } else {
                alert("No results found");
            }
        } else {
            alert("Geocoder failed due to: " + status);
        }
    });
}
parserModule.prototype.parse1 = function(token){
    var loc= parseData.pop();


    setTimeout(function(){
        app.getModule('parserModule').getGeoAndSave(loc,token);
    },2*1000);
        
}